#pragma once

#include <dolphin/mtx.h>

typedef struct BattleWorkCamera {
	u32 mFlags; //0x0
	u32 field_0x4; //0x4
	u32 mPriLimit; //0x8
	u32 mMode; //0xC
	u32 mUnit1TargetIdx; //0x10
	u32 mUnit2TargetIdx; //0x14
	u32 mUnit1PartTargetIdx; //0x18
	u32 mUnit2PartTargetIdx; //0x1C
	u32 mAudienceTargetIdx; //0x20
	f32 mZoom; //0x24
	u16 mMoveSpeedLv; //0x28
	u16 mZoomSpeedLv; //0x2A
	Vec field_0x2C; //0x2C
	Vec field_0x38; //0x38
	Vec field_0x44; //0x44
	Vec field_0x50; //0x50
	Vec mPosOffset; //0x5C
	Vec mMoveSpeed; //0x68
	Vec field_0x74; //0x74
	u32 field_0x80; //0x80
	u32 field_0x84; //0x84
	u32 field_0x88; //0x88
	Vec field_0x8C; //0x8C
	Vec field_0x98; //0x98
	Vec field_0xA4; //0xA4
	Vec field_0xB0; //0xB0
	Vec mUnit1TargetPos; //0xBC
	Vec mUnit2TargetPos; //0xC8
	u32 field_0xD4; //0xD4
	u32 field_0xD8; //0xD8
	u32 field_0xDC; //0xDC
	u32 field_0xE0; //0xE0
	u32 field_0xE4; //0xE4
	u32 field_0xE8; //0xE8
	f32 field_0xEC; //0xEC
	f32 field_0xF0; //0xF0
	f32 field_0xF4; //0xF4
	f32 field_0xF8; //0xF8
	f32 field_0xFC; //0xFC
	f32 field_0x100; //0x100
} BattleWorkCamera;

void battleCameraInit(void);