#pragma once

#include <dolphin/types.h>
#include "mgr/evtmgr.h"
#include "mgr/evtmgr_cmd.h"

typedef struct evt_shop_work {
	u32 field_0x0; //0x0
	s32 field_0x4; //0x4
	s32 field_0x8; //0x8
	s32 field_0xC; //0xC
	s32 field_0x10; //0x10
	u8 field_0x14[0x20 - 0x14]; //0x14
	s32 field_0x20; //0x20
	u8 field_0x24[0xD8 - 0x24]; //0x24
} evt_shop_work;

EvtStatus evt_shop_setup(EvtEntry* evt);