#pragma once

#include <dolphin/types.h>

typedef struct yuugijou_work {
	u32 field_0x0; //0x00
	u32 field_0x4; //0x04
	u32 mPianta; //0x08
	u32 field_0xC; //0x0C
	u32 field_0x10; //0x10
	u32 field_0x14; //0x14
	u32 field_0x18; //0x18
	u32 field_0x1C; //0x1C
	u32 field_0x20; //0x20
	u32 field_0x24; //0x24
	u32 field_0x28; //0x28
	u32 field_0x2C; //0x2C
	u32 field_0x30; //0x30
	u32 field_0x34; //0x34
	u32 field_0x38; //0x38
	u32 field_0x3C; //0x3C
	u32 field_0x40; //0x40
	u32 field_0x44; //0x44
	u32 field_0x48; //0x48
	u32 field_0x4C; //0x4C
	u32 field_0x50; //0x50
	u32 field_0x54; //0x54
	u32 field_0x58; //0x58
	u32 field_0x5C; //0x5C
	u32 field_0x60; //0x60
	u32 field_0x64; //0x64
	u32 field_0x68; //0x68
	u32 field_0x6C; //0x6C
	u32 field_0x70; //0x70
	u32 field_0x74; //0x74
	u32 field_0x78; //0x78
	u32 field_0x7C; //0x7C
	u32 field_0x80; //0x80
	u32 field_0x84; //0x84
	u32 field_0x88; //0x88
	u32 field_0x8C; //0x8C
	u32 field_0x90; //0x90
	u32 field_0x94; //0x94
	u32 field_0x98; //0x98
	u32 field_0x9C; //0x9C
	u32 field_0xA0; //0xA0
	u32 field_0xA4; //0xA4
	u32 field_0xA8; //0xA8
	u32 field_0xAC; //0xAC
	u32 field_0xB0; //0xB0
	u32 field_0xB4; //0xB4
	u32 field_0xB8; //0xB8
	u32 field_0xBC; //0xBC
	u32 field_0xC0; //0xC0
	u32 field_0xC4; //0xC4
	u32 field_0xC8; //0xC8
	u32 field_0xCC; //0xCC
	u32 field_0xD0; //0xD0
	u32 field_0xD4; //0xD4
	u32 field_0xD8; //0xD8
	u32 field_0xDC; //0xDC
	u32 field_0xE0; //0xE0
	u32 field_0xE4; //0xE4
	u32 field_0xE8; //0xE8
	u32 field_0xEC; //0xEC
	u32 field_0xF0; //0xF0
	u32 field_0xF4; //0xF4
	u32 field_0xF8; //0xF8
	u32 field_0xFC; //0xFC
	u32 field_0x100; //0x100
	u32 field_0x104; //0x104
	u32 field_0x108; //0x108
	u32 field_0x10C; //0x10C
	u32 field_0x110; //0x110
	u32 field_0x114; //0x114
	u32 field_0x118; //0x118
	u32 field_0x11C; //0x11C
	u32 field_0x120; //0x120
	u32 field_0x124; //0x124
	u32 field_0x128; //0x128
	u32 field_0x12C; //0x12C
	u32 field_0x130; //0x130
	u32 field_0x134; //0x134
} yuugijou_work;

void yuugijou_init(void);

