#pragma once

#ifdef __INTELLISENSE__
#define HW2
#define MTX_USE_PS
#endif

#include <dolphin/gx.h>
#include <dolphin/mtx.h>
#include <dolphin/vi.h>
#include "DEMO/DEMOInit.h"

//TODO: everything
typedef struct marioSt_gp {
	u32 state; //0x00
	u32 field_0x4; //0x04
	u32 field_0x8; //0x08
	u32 field_0xC; //0x0C
	u32 field_0x10; //0x10
	u32 field_0x14; //0x14
	u32 field_0x18; //0x18
	u32 field_0x1C; //0x1C
	u64 field_0x20; //0x20
	u64 field_0x28; //0x28
	OSTime startTime; //0x30
	u64 field_0x38; //0x38
	u64 field_0x40; //0x40
	u64 field_0x48; //0x48
	u64 field_0x50; //0x50
	u64 field_0x58; //0x58
	u64 field_0x60; //0x60
	u32 field_0x68; //0x68
	u32 field_0x6C; //0x6C
	u32 field_0x70; //0x70
	u32 field_0x74; //0x74
	u32 field_0x78; //0x78
	u32 field_0x7C; //0x7C
	u32 field_0x80; //0x80
	u32 field_0x84; //0x84
	u32 field_0x88; //0x88
	u32 field_0x8C; //0x8C
	u32 field_0x90; //0x90
	u32 field_0x94; //0x94
	u32 field_0x98; //0x98
	u32 field_0x9C; //0x9C
	u32 field_0xA0; //0xA0
	u32 field_0xA4; //0xA4
	u32 field_0xA8; //0xA8
	u32 field_0xAC; //0xAC
	u32 field_0xB0; //0xB0
	u32 field_0xB4; //0xB4
	u32 field_0xB8; //0xB8
	u32 field_0xBC; //0xBC
	u32 field_0xC0; //0xC0
	u32 field_0xC4; //0xC4
	u32 field_0xC8; //0xC8
	u32 field_0xCC; //0xCC
	u32 field_0xD0; //0xD0
	u32 field_0xD4; //0xD4
	u32 field_0xD8; //0xD8
	u32 field_0xDC; //0xDC
	u32 field_0xE0; //0xE0
	u32 field_0xE4; //0xE4
	u32 field_0xE8; //0xE8
	u32 field_0xEC; //0xEC
	u32 field_0xF0; //0xF0
	u32 field_0xF4; //0xF4
	u32 field_0xF8; //0xF8
	u32 field_0xFC; //0xFC
	u32 field_0x100; //0x100
	u32 field_0x104; //0x104
	u32 field_0x108; //0x108
	u32 field_0x10C; //0x10C
	u32 field_0x110; //0x110
	u32 field_0x114; //0x114
	u32 field_0x118; //0x118
	u32 field_0x11C; //0x11C
	u32 field_0x120; //0x120
	u32 field_0x124; //0x124
	u32 field_0x128; //0x128
	u32 field_0x12C; //0x12C
	u32 field_0x130; //0x130
	u32 field_0x134; //0x134
	u32 field_0x138; //0x138
	u32 field_0x13C; //0x13C
	u32 field_0x140; //0x140
	u32 field_0x144; //0x144
	u32 field_0x148; //0x148
	u32 field_0x14C; //0x14C
	u32 field_0x150; //0x150
	u32 field_0x154; //0x154
	u32 field_0x158; //0x158
	u32 field_0x15C; //0x15C
	void* field_0x160; //0x160
	u32 field_0x164; //0x164
	u32 field_0x168; //0x168
	u32 isJP; //0x16C, TODO isUS?
	u16 fbWidth; //0x170
	u16 efbHeight; //0x172
	u32 field_0x174; //0x174
	u32 swBitData[0x100];   //0x178-0x578
	u8  swByteData[0x800];  //0x578-0xD78
	u32 _swBitData[0x10];   //0xD78-0xDB8
	u8  _swByteData[0x400]; //0xDB8-0x11B8
	u32 field_0x11B8; //0x11B8
	u32 field_0x11BC; //0x11BC
	u32 field_0x11C0; //0x11C0
	u32 field_0x11C4; //0x11C4
	u32 field_0x11C8; //0x11C8
	u32 field_0x11CC; //0x11CC
	u32 field_0x11D0; //0x11D0
	u32 field_0x11D4; //0x11D4
	u32 field_0x11D8; //0x11D8
	u32 field_0x11DC; //0x11DC
	u32 field_0x11E0; //0x11E0
	u32 field_0x11E4; //0x11E4
	u32 field_0x11E8; //0x11E8
	u32 field_0x11EC; //0x11EC
	u32 field_0x11F0; //0x11F0
	u32 field_0x11F4; //0x11F4
	u32 field_0x11F8; //0x11F8
	u32 field_0x11FC; //0x11FC
	u32 field_0x1200; //0x1200
	u32 field_0x1204; //0x1204
	u32 field_0x1208; //0x1208
	u32 field_0x120C; //0x120C
	u32 field_0x1210; //0x1210
	u32 field_0x1214; //0x1214
	u32 field_0x1218; //0x1218
	u32 field_0x121C; //0x121C
	u32 field_0x1220; //0x1220
	u32 field_0x1224; //0x1224
	u32 field_0x1228; //0x1228
	u32 field_0x122C; //0x122C
	u32 field_0x1230; //0x1230
	u32 field_0x1234; //0x1234
	u32 field_0x1238; //0x1238
	u32 field_0x123C; //0x123C
	u32 field_0x1240; //0x1240
	u32 field_0x1244; //0x1244
	u32 field_0x1248; //0x1248
	u32 field_0x124C; //0x124C
	u32 field_0x1250; //0x1250
	u32 field_0x1254; //0x1254
	u32 field_0x1258; //0x1258
	u32 field_0x125C; //0x125C
	u32 field_0x1260; //0x1260
	u32 field_0x1264; //0x1264
	u32 field_0x1268; //0x1268
	u32 field_0x126C; //0x126C
	u32 field_0x1270; //0x1270
	u32 field_0x1274; //0x1274
	u32 field_0x1278; //0x1278
	u32 field_0x127C; //0x127C
	u32 field_0x1280; //0x1280
	u32 field_0x1284; //0x1284
	u32 field_0x1288; //0x1288
	u32 field_0x128C; //0x128C
	u32 field_0x1290; //0x1290
	u32 field_0x1294; //0x1294
	u32 field_0x1298; //0x1298
	u32 field_0x129C; //0x129C
	u32 field_0x12A0; //0x12A0
	u32 field_0x12A4; //0x12A4
	u32 field_0x12A8; //0x12A8
	u32 field_0x12AC; //0x12AC
	u32 field_0x12B0; //0x12B0
	u32 field_0x12B4; //0x12B4
	u32 field_0x12B8; //0x12B8
	u32 field_0x12BC; //0x12BC
	u32 field_0x12C0; //0x12C0
	u32 field_0x12C4; //0x12C4
	u32 field_0x12C8; //0x12C8
	u32 field_0x12CC; //0x12CC
	u32 field_0x12D0; //0x12D0
	u32 field_0x12D4; //0x12D4
	u32 field_0x12D8; //0x12D8
	u32 field_0x12DC; //0x12DC
	u32 field_0x12E0; //0x12E0
	u32 field_0x12E4; //0x12E4
	u32 field_0x12E8; //0x12E8
	u32 field_0x12EC; //0x12EC
	u32 field_0x12F0; //0x12F0
	u32 field_0x12F4; //0x12F4
	u32 field_0x12F8; //0x12F8
	u32 field_0x12FC; //0x12FC
	u32 field_0x1300; //0x1300
	u32 field_0x1304; //0x1304
	u32 field_0x1308; //0x1308
	u32 field_0x130C; //0x130C
	u32 field_0x1310; //0x1310
	u32 deltaGame; //0x1314
	u32 deltaRender; //0x1318
	u32 field_0x131C; //0x131C
	u32 field_0x1320; //0x1320
	u32 field_0x1324; //0x1324
	u32 field_0x1328; //0x1328
	u32 field_0x132C; //0x132C
	u32 field_0x1330; //0x1330
	u32 field_0x1334; //0x1334
	u32 field_0x1338; //0x1338
	u32 field_0x133C; //0x133C
	u32 field_0x1340; //0x1340
	u32 field_0x1344; //0x1344
	u32 field_0x1348; //0x1348
	u32 field_0x134C; //0x134C
	u32 field_0x1350; //0x1350
	u32 field_0x1354; //0x1354
	u32 field_0x1358; //0x1358
	u32 field_0x135C; //0x135C
	u32 field_0x1360; //0x1360
	u32 field_0x1364; //0x1364
	u32 field_0x1368; //0x1368
	u32 field_0x136C; //0x136C
	u32 field_0x1370; //0x1370
	u32 field_0x1374; //0x1374
	u32 field_0x1378; //0x1378
	u32 field_0x137C; //0x137C
	u32 field_0x1380; //0x1380
	u32 field_0x1384; //0x1384
	u32 field_0x1388; //0x1388
	u32 field_0x138C; //0x138C
	u32 field_0x1390; //0x1390
	u32 field_0x1394; //0x1394
	u32 field_0x1398; //0x1398
	u32 field_0x139C; //0x139C
	u32 field_0x13A0; //0x13A0
	u32 field_0x13A4; //0x13A4
	u32 field_0x13A8; //0x13A8
	u32 field_0x13AC; //0x13AC
	u32 field_0x13B0; //0x13B0
	u32 field_0x13B4; //0x13B4
	u32 field_0x13B8; //0x13B8
	u32 field_0x13BC; //0x13BC
	u32 field_0x13C0; //0x13C0
	u32 field_0x13C4; //0x13C4
	u32 field_0x13C8; //0x13C8
	u32 field_0x13CC; //0x13CC
	u32 field_0x13D0; //0x13D0
	u32 field_0x13D4; //0x13D4
} marioSt_gp;