#pragma once

#ifdef __INTELLISENSE__
#define HW2
#define MTX_USE_PS
#endif

#include <dolphin/gx.h>
#include <dolphin/mtx.h>
#include <dolphin/vi.h>
#include "DEMO/DEMOInit.h"

//TODO: everything
typedef struct marioSt_gp {
	u32 state; //0x00
	u32 field_0x4; //0x04
	u32 field_0x8; //0x08
	u32 field_0xC; //0x0C
	u32 field_0x10; //0x10
	u32 field_0x14; //0x14
	u32 field_0x18; //0x18
	u32 field_0x1C; //0x1C
	u64 field_0x20; //0x20
	u64 field_0x28; //0x28
	OSTime startTime; //0x30
	u64 field_0x38; //0x38
	u64 field_0x40; //0x40
	u64 field_0x48; //0x48
	u64 field_0x50; //0x50
	u64 field_0x58; //0x58
	u64 field_0x60; //0x60
	u32 field_0x68; //0x68
	u32 field_0x6C; //0x6C
	u32 field_0x70; //0x70
	u32 field_0x74; //0x74
	u32 field_0x78; //0x78
	u32 field_0x7C; //0x7C
	u32 field_0x80; //0x80
	u32 field_0x84; //0x84
	u32 field_0x88; //0x88
	u32 field_0x8C; //0x8C
	u32 field_0x90; //0x90
	u32 field_0x94; //0x94
	u32 field_0x98; //0x98
	u32 field_0x9C; //0x9C
	u32 field_0xA0; //0xA0
	u32 field_0xA4; //0xA4
	u32 field_0xA8; //0xA8
	u32 field_0xAC; //0xAC
	u32 field_0xB0; //0xB0
	u32 field_0xB4; //0xB4
	u32 field_0xB8; //0xB8
	u32 field_0xBC; //0xBC
	u32 field_0xC0; //0xC0
	u32 field_0xC4; //0xC4
	u32 field_0xC8; //0xC8
	u32 field_0xCC; //0xCC
	u32 field_0xD0; //0xD0
	u32 field_0xD4; //0xD4
	u32 field_0xD8; //0xD8
	u32 field_0xDC; //0xDC
	u32 field_0xE0; //0xE0
	u32 field_0xE4; //0xE4
	u32 field_0xE8; //0xE8
	u32 field_0xEC; //0xEC
	u32 field_0xF0; //0xF0
	u32 field_0xF4; //0xF4
	u32 field_0xF8; //0xF8
	u32 field_0xFC; //0xFC
	u32 field_0x100; //0x100
	u32 field_0x104; //0x104
	u32 field_0x108; //0x108
	u32 field_0x10C; //0x10C
	u32 field_0x110; //0x110
	u32 field_0x114; //0x114
	u32 field_0x118; //0x118
	u32 field_0x11C; //0x11C
	u32 field_0x120; //0x120
	u32 field_0x124; //0x124
	u32 field_0x128; //0x128
	u32 field_0x12C; //0x12C
	u32 field_0x130; //0x130
	u32 field_0x134; //0x134
	u32 field_0x138; //0x138
	u32 field_0x13C; //0x13C
	u32 field_0x140; //0x140
	u32 field_0x144; //0x144
	u32 field_0x148; //0x148
	u32 field_0x14C; //0x14C
	u32 field_0x150; //0x150
	u32 field_0x154; //0x154
	u32 field_0x158; //0x158
	u32 field_0x15C; //0x15C
	u32 field_0x160; //0x160
	u32 field_0x164; //0x164
	u32 field_0x168; //0x168
	u32 isJP; //0x16C, TODO isUS?
	u16 fbWidth; //0x170
	u16 efbHeight; //0x172
	u32 field_0x174; //0x174
	u32 field_0x178; //0x178
	u32 field_0x17C; //0x17C
	u32 field_0x180; //0x180
	u32 field_0x184; //0x184
	u32 field_0x188; //0x188
	u32 field_0x18C; //0x18C
	u32 field_0x190; //0x190
	u32 field_0x194; //0x194
	u32 field_0x198; //0x198
	u32 field_0x19C; //0x19C
	u32 field_0x1A0; //0x1A0
	u32 field_0x1A4; //0x1A4
	u32 field_0x1A8; //0x1A8
	u32 field_0x1AC; //0x1AC
	u32 field_0x1B0; //0x1B0
	u32 field_0x1B4; //0x1B4
	u32 field_0x1B8; //0x1B8
	u32 field_0x1BC; //0x1BC
	u32 field_0x1C0; //0x1C0
	u32 field_0x1C4; //0x1C4
	u32 field_0x1C8; //0x1C8
	u32 field_0x1CC; //0x1CC
	u32 field_0x1D0; //0x1D0
	u32 field_0x1D4; //0x1D4
	u32 field_0x1D8; //0x1D8
	u32 field_0x1DC; //0x1DC
	u32 field_0x1E0; //0x1E0
	u32 field_0x1E4; //0x1E4
	u32 field_0x1E8; //0x1E8
	u32 field_0x1EC; //0x1EC
	u32 field_0x1F0; //0x1F0
	u32 field_0x1F4; //0x1F4
	u32 field_0x1F8; //0x1F8
	u32 field_0x1FC; //0x1FC
	u32 field_0x200; //0x200
	u32 field_0x204; //0x204
	u32 field_0x208; //0x208
	u32 field_0x20C; //0x20C
	u32 field_0x210; //0x210
	u32 field_0x214; //0x214
	u32 field_0x218; //0x218
	u32 field_0x21C; //0x21C
	u32 field_0x220; //0x220
	u32 field_0x224; //0x224
	u32 field_0x228; //0x228
	u32 field_0x22C; //0x22C
	u32 field_0x230; //0x230
	u32 field_0x234; //0x234
	u32 field_0x238; //0x238
	u32 field_0x23C; //0x23C
	u32 field_0x240; //0x240
	u32 field_0x244; //0x244
	u32 field_0x248; //0x248
	u32 field_0x24C; //0x24C
	u32 field_0x250; //0x250
	u32 field_0x254; //0x254
	u32 field_0x258; //0x258
	u32 field_0x25C; //0x25C
	u32 field_0x260; //0x260
	u32 field_0x264; //0x264
	u32 field_0x268; //0x268
	u32 field_0x26C; //0x26C
	u32 field_0x270; //0x270
	u32 field_0x274; //0x274
	u32 field_0x278; //0x278
	u32 field_0x27C; //0x27C
	u32 field_0x280; //0x280
	u32 field_0x284; //0x284
	u32 field_0x288; //0x288
	u32 field_0x28C; //0x28C
	u32 field_0x290; //0x290
	u32 field_0x294; //0x294
	u32 field_0x298; //0x298
	u32 field_0x29C; //0x29C
	u32 field_0x2A0; //0x2A0
	u32 field_0x2A4; //0x2A4
	u32 field_0x2A8; //0x2A8
	u32 field_0x2AC; //0x2AC
	u32 field_0x2B0; //0x2B0
	u32 field_0x2B4; //0x2B4
	u32 field_0x2B8; //0x2B8
	u32 field_0x2BC; //0x2BC
	u32 field_0x2C0; //0x2C0
	u32 field_0x2C4; //0x2C4
	u32 field_0x2C8; //0x2C8
	u32 field_0x2CC; //0x2CC
	u32 field_0x2D0; //0x2D0
	u32 field_0x2D4; //0x2D4
	u32 field_0x2D8; //0x2D8
	u32 field_0x2DC; //0x2DC
	u32 field_0x2E0; //0x2E0
	u32 field_0x2E4; //0x2E4
	u32 field_0x2E8; //0x2E8
	u32 field_0x2EC; //0x2EC
	u32 field_0x2F0; //0x2F0
	u32 field_0x2F4; //0x2F4
	u32 field_0x2F8; //0x2F8
	u32 field_0x2FC; //0x2FC
	u32 field_0x300; //0x300
	u32 field_0x304; //0x304
	u32 field_0x308; //0x308
	u32 field_0x30C; //0x30C
	u32 field_0x310; //0x310
	u32 field_0x314; //0x314
	u32 field_0x318; //0x318
	u32 field_0x31C; //0x31C
	u32 field_0x320; //0x320
	u32 field_0x324; //0x324
	u32 field_0x328; //0x328
	u32 field_0x32C; //0x32C
	u32 field_0x330; //0x330
	u32 field_0x334; //0x334
	u32 field_0x338; //0x338
	u32 field_0x33C; //0x33C
	u32 field_0x340; //0x340
	u32 field_0x344; //0x344
	u32 field_0x348; //0x348
	u32 field_0x34C; //0x34C
	u32 field_0x350; //0x350
	u32 field_0x354; //0x354
	u32 field_0x358; //0x358
	u32 field_0x35C; //0x35C
	u32 field_0x360; //0x360
	u32 field_0x364; //0x364
	u32 field_0x368; //0x368
	u32 field_0x36C; //0x36C
	u32 field_0x370; //0x370
	u32 field_0x374; //0x374
	u32 field_0x378; //0x378
	u32 field_0x37C; //0x37C
	u32 field_0x380; //0x380
	u32 field_0x384; //0x384
	u32 field_0x388; //0x388
	u32 field_0x38C; //0x38C
	u32 field_0x390; //0x390
	u32 field_0x394; //0x394
	u32 field_0x398; //0x398
	u32 field_0x39C; //0x39C
	u32 field_0x3A0; //0x3A0
	u32 field_0x3A4; //0x3A4
	u32 field_0x3A8; //0x3A8
	u32 field_0x3AC; //0x3AC
	u32 field_0x3B0; //0x3B0
	u32 field_0x3B4; //0x3B4
	u32 field_0x3B8; //0x3B8
	u32 field_0x3BC; //0x3BC
	u32 field_0x3C0; //0x3C0
	u32 field_0x3C4; //0x3C4
	u32 field_0x3C8; //0x3C8
	u32 field_0x3CC; //0x3CC
	u32 field_0x3D0; //0x3D0
	u32 field_0x3D4; //0x3D4
	u32 field_0x3D8; //0x3D8
	u32 field_0x3DC; //0x3DC
	u32 field_0x3E0; //0x3E0
	u32 field_0x3E4; //0x3E4
	u32 field_0x3E8; //0x3E8
	u32 field_0x3EC; //0x3EC
	u32 field_0x3F0; //0x3F0
	u32 field_0x3F4; //0x3F4
	u32 field_0x3F8; //0x3F8
	u32 field_0x3FC; //0x3FC
	u32 field_0x400; //0x400
	u32 field_0x404; //0x404
	u32 field_0x408; //0x408
	u32 field_0x40C; //0x40C
	u32 field_0x410; //0x410
	u32 field_0x414; //0x414
	u32 field_0x418; //0x418
	u32 field_0x41C; //0x41C
	u32 field_0x420; //0x420
	u32 field_0x424; //0x424
	u32 field_0x428; //0x428
	u32 field_0x42C; //0x42C
	u32 field_0x430; //0x430
	u32 field_0x434; //0x434
	u32 field_0x438; //0x438
	u32 field_0x43C; //0x43C
	u32 field_0x440; //0x440
	u32 field_0x444; //0x444
	u32 field_0x448; //0x448
	u32 field_0x44C; //0x44C
	u32 field_0x450; //0x450
	u32 field_0x454; //0x454
	u32 field_0x458; //0x458
	u32 field_0x45C; //0x45C
	u32 field_0x460; //0x460
	u32 field_0x464; //0x464
	u32 field_0x468; //0x468
	u32 field_0x46C; //0x46C
	u32 field_0x470; //0x470
	u32 field_0x474; //0x474
	u32 field_0x478; //0x478
	u32 field_0x47C; //0x47C
	u32 field_0x480; //0x480
	u32 field_0x484; //0x484
	u32 field_0x488; //0x488
	u32 field_0x48C; //0x48C
	u32 field_0x490; //0x490
	u32 field_0x494; //0x494
	u32 field_0x498; //0x498
	u32 field_0x49C; //0x49C
	u32 field_0x4A0; //0x4A0
	u32 field_0x4A4; //0x4A4
	u32 field_0x4A8; //0x4A8
	u32 field_0x4AC; //0x4AC
	u32 field_0x4B0; //0x4B0
	u32 field_0x4B4; //0x4B4
	u32 field_0x4B8; //0x4B8
	u32 field_0x4BC; //0x4BC
	u32 field_0x4C0; //0x4C0
	u32 field_0x4C4; //0x4C4
	u32 field_0x4C8; //0x4C8
	u32 field_0x4CC; //0x4CC
	u32 field_0x4D0; //0x4D0
	u32 field_0x4D4; //0x4D4
	u32 field_0x4D8; //0x4D8
	u32 field_0x4DC; //0x4DC
	u32 field_0x4E0; //0x4E0
	u32 field_0x4E4; //0x4E4
	u32 field_0x4E8; //0x4E8
	u32 field_0x4EC; //0x4EC
	u32 field_0x4F0; //0x4F0
	u32 field_0x4F4; //0x4F4
	u32 field_0x4F8; //0x4F8
	u32 field_0x4FC; //0x4FC
	u32 field_0x500; //0x500
	u32 field_0x504; //0x504
	u32 field_0x508; //0x508
	u32 field_0x50C; //0x50C
	u32 field_0x510; //0x510
	u32 field_0x514; //0x514
	u32 field_0x518; //0x518
	u32 field_0x51C; //0x51C
	u32 field_0x520; //0x520
	u32 field_0x524; //0x524
	u32 field_0x528; //0x528
	u32 field_0x52C; //0x52C
	u32 field_0x530; //0x530
	u32 field_0x534; //0x534
	u32 field_0x538; //0x538
	u32 field_0x53C; //0x53C
	u32 field_0x540; //0x540
	u32 field_0x544; //0x544
	u32 field_0x548; //0x548
	u32 field_0x54C; //0x54C
	u32 field_0x550; //0x550
	u32 field_0x554; //0x554
	u32 field_0x558; //0x558
	u32 field_0x55C; //0x55C
	u32 field_0x560; //0x560
	u32 field_0x564; //0x564
	u32 field_0x568; //0x568
	u32 field_0x56C; //0x56C
	u32 field_0x570; //0x570
	u32 field_0x574; //0x574
	u32 field_0x578; //0x578
	u32 field_0x57C; //0x57C
	u32 field_0x580; //0x580
	u32 field_0x584; //0x584
	u32 field_0x588; //0x588
	u32 field_0x58C; //0x58C
	u32 field_0x590; //0x590
	u32 field_0x594; //0x594
	u32 field_0x598; //0x598
	u32 field_0x59C; //0x59C
	u32 field_0x5A0; //0x5A0
	u32 field_0x5A4; //0x5A4
	u32 field_0x5A8; //0x5A8
	u32 field_0x5AC; //0x5AC
	u32 field_0x5B0; //0x5B0
	u32 field_0x5B4; //0x5B4
	u32 field_0x5B8; //0x5B8
	u32 field_0x5BC; //0x5BC
	u32 field_0x5C0; //0x5C0
	u32 field_0x5C4; //0x5C4
	u32 field_0x5C8; //0x5C8
	u32 field_0x5CC; //0x5CC
	u32 field_0x5D0; //0x5D0
	u32 field_0x5D4; //0x5D4
	u32 field_0x5D8; //0x5D8
	u32 field_0x5DC; //0x5DC
	u32 field_0x5E0; //0x5E0
	u32 field_0x5E4; //0x5E4
	u32 field_0x5E8; //0x5E8
	u32 field_0x5EC; //0x5EC
	u32 field_0x5F0; //0x5F0
	u32 field_0x5F4; //0x5F4
	u32 field_0x5F8; //0x5F8
	u32 field_0x5FC; //0x5FC
	u32 field_0x600; //0x600
	u32 field_0x604; //0x604
	u32 field_0x608; //0x608
	u32 field_0x60C; //0x60C
	u32 field_0x610; //0x610
	u32 field_0x614; //0x614
	u32 field_0x618; //0x618
	u32 field_0x61C; //0x61C
	u32 field_0x620; //0x620
	u32 field_0x624; //0x624
	u32 field_0x628; //0x628
	u32 field_0x62C; //0x62C
	u32 field_0x630; //0x630
	u32 field_0x634; //0x634
	u32 field_0x638; //0x638
	u32 field_0x63C; //0x63C
	u32 field_0x640; //0x640
	u32 field_0x644; //0x644
	u32 field_0x648; //0x648
	u32 field_0x64C; //0x64C
	u32 field_0x650; //0x650
	u32 field_0x654; //0x654
	u32 field_0x658; //0x658
	u32 field_0x65C; //0x65C
	u32 field_0x660; //0x660
	u32 field_0x664; //0x664
	u32 field_0x668; //0x668
	u32 field_0x66C; //0x66C
	u32 field_0x670; //0x670
	u32 field_0x674; //0x674
	u32 field_0x678; //0x678
	u32 field_0x67C; //0x67C
	u32 field_0x680; //0x680
	u32 field_0x684; //0x684
	u32 field_0x688; //0x688
	u32 field_0x68C; //0x68C
	u32 field_0x690; //0x690
	u32 field_0x694; //0x694
	u32 field_0x698; //0x698
	u32 field_0x69C; //0x69C
	u32 field_0x6A0; //0x6A0
	u32 field_0x6A4; //0x6A4
	u32 field_0x6A8; //0x6A8
	u32 field_0x6AC; //0x6AC
	u32 field_0x6B0; //0x6B0
	u32 field_0x6B4; //0x6B4
	u32 field_0x6B8; //0x6B8
	u32 field_0x6BC; //0x6BC
	u32 field_0x6C0; //0x6C0
	u32 field_0x6C4; //0x6C4
	u32 field_0x6C8; //0x6C8
	u32 field_0x6CC; //0x6CC
	u32 field_0x6D0; //0x6D0
	u32 field_0x6D4; //0x6D4
	u32 field_0x6D8; //0x6D8
	u32 field_0x6DC; //0x6DC
	u32 field_0x6E0; //0x6E0
	u32 field_0x6E4; //0x6E4
	u32 field_0x6E8; //0x6E8
	u32 field_0x6EC; //0x6EC
	u32 field_0x6F0; //0x6F0
	u32 field_0x6F4; //0x6F4
	u32 field_0x6F8; //0x6F8
	u32 field_0x6FC; //0x6FC
	u32 field_0x700; //0x700
	u32 field_0x704; //0x704
	u32 field_0x708; //0x708
	u32 field_0x70C; //0x70C
	u32 field_0x710; //0x710
	u32 field_0x714; //0x714
	u32 field_0x718; //0x718
	u32 field_0x71C; //0x71C
	u32 field_0x720; //0x720
	u32 field_0x724; //0x724
	u32 field_0x728; //0x728
	u32 field_0x72C; //0x72C
	u32 field_0x730; //0x730
	u32 field_0x734; //0x734
	u32 field_0x738; //0x738
	u32 field_0x73C; //0x73C
	u32 field_0x740; //0x740
	u32 field_0x744; //0x744
	u32 field_0x748; //0x748
	u32 field_0x74C; //0x74C
	u32 field_0x750; //0x750
	u32 field_0x754; //0x754
	u32 field_0x758; //0x758
	u32 field_0x75C; //0x75C
	u32 field_0x760; //0x760
	u32 field_0x764; //0x764
	u32 field_0x768; //0x768
	u32 field_0x76C; //0x76C
	u32 field_0x770; //0x770
	u32 field_0x774; //0x774
	u32 field_0x778; //0x778
	u32 field_0x77C; //0x77C
	u32 field_0x780; //0x780
	u32 field_0x784; //0x784
	u32 field_0x788; //0x788
	u32 field_0x78C; //0x78C
	u32 field_0x790; //0x790
	u32 field_0x794; //0x794
	u32 field_0x798; //0x798
	u32 field_0x79C; //0x79C
	u32 field_0x7A0; //0x7A0
	u32 field_0x7A4; //0x7A4
	u32 field_0x7A8; //0x7A8
	u32 field_0x7AC; //0x7AC
	u32 field_0x7B0; //0x7B0
	u32 field_0x7B4; //0x7B4
	u32 field_0x7B8; //0x7B8
	u32 field_0x7BC; //0x7BC
	u32 field_0x7C0; //0x7C0
	u32 field_0x7C4; //0x7C4
	u32 field_0x7C8; //0x7C8
	u32 field_0x7CC; //0x7CC
	u32 field_0x7D0; //0x7D0
	u32 field_0x7D4; //0x7D4
	u32 field_0x7D8; //0x7D8
	u32 field_0x7DC; //0x7DC
	u32 field_0x7E0; //0x7E0
	u32 field_0x7E4; //0x7E4
	u32 field_0x7E8; //0x7E8
	u32 field_0x7EC; //0x7EC
	u32 field_0x7F0; //0x7F0
	u32 field_0x7F4; //0x7F4
	u32 field_0x7F8; //0x7F8
	u32 field_0x7FC; //0x7FC
	u32 field_0x800; //0x800
	u32 field_0x804; //0x804
	u32 field_0x808; //0x808
	u32 field_0x80C; //0x80C
	u32 field_0x810; //0x810
	u32 field_0x814; //0x814
	u32 field_0x818; //0x818
	u32 field_0x81C; //0x81C
	u32 field_0x820; //0x820
	u32 field_0x824; //0x824
	u32 field_0x828; //0x828
	u32 field_0x82C; //0x82C
	u32 field_0x830; //0x830
	u32 field_0x834; //0x834
	u32 field_0x838; //0x838
	u32 field_0x83C; //0x83C
	u32 field_0x840; //0x840
	u32 field_0x844; //0x844
	u32 field_0x848; //0x848
	u32 field_0x84C; //0x84C
	u32 field_0x850; //0x850
	u32 field_0x854; //0x854
	u32 field_0x858; //0x858
	u32 field_0x85C; //0x85C
	u32 field_0x860; //0x860
	u32 field_0x864; //0x864
	u32 field_0x868; //0x868
	u32 field_0x86C; //0x86C
	u32 field_0x870; //0x870
	u32 field_0x874; //0x874
	u32 field_0x878; //0x878
	u32 field_0x87C; //0x87C
	u32 field_0x880; //0x880
	u32 field_0x884; //0x884
	u32 field_0x888; //0x888
	u32 field_0x88C; //0x88C
	u32 field_0x890; //0x890
	u32 field_0x894; //0x894
	u32 field_0x898; //0x898
	u32 field_0x89C; //0x89C
	u32 field_0x8A0; //0x8A0
	u32 field_0x8A4; //0x8A4
	u32 field_0x8A8; //0x8A8
	u32 field_0x8AC; //0x8AC
	u32 field_0x8B0; //0x8B0
	u32 field_0x8B4; //0x8B4
	u32 field_0x8B8; //0x8B8
	u32 field_0x8BC; //0x8BC
	u32 field_0x8C0; //0x8C0
	u32 field_0x8C4; //0x8C4
	u32 field_0x8C8; //0x8C8
	u32 field_0x8CC; //0x8CC
	u32 field_0x8D0; //0x8D0
	u32 field_0x8D4; //0x8D4
	u32 field_0x8D8; //0x8D8
	u32 field_0x8DC; //0x8DC
	u32 field_0x8E0; //0x8E0
	u32 field_0x8E4; //0x8E4
	u32 field_0x8E8; //0x8E8
	u32 field_0x8EC; //0x8EC
	u32 field_0x8F0; //0x8F0
	u32 field_0x8F4; //0x8F4
	u32 field_0x8F8; //0x8F8
	u32 field_0x8FC; //0x8FC
	u32 field_0x900; //0x900
	u32 field_0x904; //0x904
	u32 field_0x908; //0x908
	u32 field_0x90C; //0x90C
	u32 field_0x910; //0x910
	u32 field_0x914; //0x914
	u32 field_0x918; //0x918
	u32 field_0x91C; //0x91C
	u32 field_0x920; //0x920
	u32 field_0x924; //0x924
	u32 field_0x928; //0x928
	u32 field_0x92C; //0x92C
	u32 field_0x930; //0x930
	u32 field_0x934; //0x934
	u32 field_0x938; //0x938
	u32 field_0x93C; //0x93C
	u32 field_0x940; //0x940
	u32 field_0x944; //0x944
	u32 field_0x948; //0x948
	u32 field_0x94C; //0x94C
	u32 field_0x950; //0x950
	u32 field_0x954; //0x954
	u32 field_0x958; //0x958
	u32 field_0x95C; //0x95C
	u32 field_0x960; //0x960
	u32 field_0x964; //0x964
	u32 field_0x968; //0x968
	u32 field_0x96C; //0x96C
	u32 field_0x970; //0x970
	u32 field_0x974; //0x974
	u32 field_0x978; //0x978
	u32 field_0x97C; //0x97C
	u32 field_0x980; //0x980
	u32 field_0x984; //0x984
	u32 field_0x988; //0x988
	u32 field_0x98C; //0x98C
	u32 field_0x990; //0x990
	u32 field_0x994; //0x994
	u32 field_0x998; //0x998
	u32 field_0x99C; //0x99C
	u32 field_0x9A0; //0x9A0
	u32 field_0x9A4; //0x9A4
	u32 field_0x9A8; //0x9A8
	u32 field_0x9AC; //0x9AC
	u32 field_0x9B0; //0x9B0
	u32 field_0x9B4; //0x9B4
	u32 field_0x9B8; //0x9B8
	u32 field_0x9BC; //0x9BC
	u32 field_0x9C0; //0x9C0
	u32 field_0x9C4; //0x9C4
	u32 field_0x9C8; //0x9C8
	u32 field_0x9CC; //0x9CC
	u32 field_0x9D0; //0x9D0
	u32 field_0x9D4; //0x9D4
	u32 field_0x9D8; //0x9D8
	u32 field_0x9DC; //0x9DC
	u32 field_0x9E0; //0x9E0
	u32 field_0x9E4; //0x9E4
	u32 field_0x9E8; //0x9E8
	u32 field_0x9EC; //0x9EC
	u32 field_0x9F0; //0x9F0
	u32 field_0x9F4; //0x9F4
	u32 field_0x9F8; //0x9F8
	u32 field_0x9FC; //0x9FC
	u32 field_0xA00; //0xA00
	u32 field_0xA04; //0xA04
	u32 field_0xA08; //0xA08
	u32 field_0xA0C; //0xA0C
	u32 field_0xA10; //0xA10
	u32 field_0xA14; //0xA14
	u32 field_0xA18; //0xA18
	u32 field_0xA1C; //0xA1C
	u32 field_0xA20; //0xA20
	u32 field_0xA24; //0xA24
	u32 field_0xA28; //0xA28
	u32 field_0xA2C; //0xA2C
	u32 field_0xA30; //0xA30
	u32 field_0xA34; //0xA34
	u32 field_0xA38; //0xA38
	u32 field_0xA3C; //0xA3C
	u32 field_0xA40; //0xA40
	u32 field_0xA44; //0xA44
	u32 field_0xA48; //0xA48
	u32 field_0xA4C; //0xA4C
	u32 field_0xA50; //0xA50
	u32 field_0xA54; //0xA54
	u32 field_0xA58; //0xA58
	u32 field_0xA5C; //0xA5C
	u32 field_0xA60; //0xA60
	u32 field_0xA64; //0xA64
	u32 field_0xA68; //0xA68
	u32 field_0xA6C; //0xA6C
	u32 field_0xA70; //0xA70
	u32 field_0xA74; //0xA74
	u32 field_0xA78; //0xA78
	u32 field_0xA7C; //0xA7C
	u32 field_0xA80; //0xA80
	u32 field_0xA84; //0xA84
	u32 field_0xA88; //0xA88
	u32 field_0xA8C; //0xA8C
	u32 field_0xA90; //0xA90
	u32 field_0xA94; //0xA94
	u32 field_0xA98; //0xA98
	u32 field_0xA9C; //0xA9C
	u32 field_0xAA0; //0xAA0
	u32 field_0xAA4; //0xAA4
	u32 field_0xAA8; //0xAA8
	u32 field_0xAAC; //0xAAC
	u32 field_0xAB0; //0xAB0
	u32 field_0xAB4; //0xAB4
	u32 field_0xAB8; //0xAB8
	u32 field_0xABC; //0xABC
	u32 field_0xAC0; //0xAC0
	u32 field_0xAC4; //0xAC4
	u32 field_0xAC8; //0xAC8
	u32 field_0xACC; //0xACC
	u32 field_0xAD0; //0xAD0
	u32 field_0xAD4; //0xAD4
	u32 field_0xAD8; //0xAD8
	u32 field_0xADC; //0xADC
	u32 field_0xAE0; //0xAE0
	u32 field_0xAE4; //0xAE4
	u32 field_0xAE8; //0xAE8
	u32 field_0xAEC; //0xAEC
	u32 field_0xAF0; //0xAF0
	u32 field_0xAF4; //0xAF4
	u32 field_0xAF8; //0xAF8
	u32 field_0xAFC; //0xAFC
	u32 field_0xB00; //0xB00
	u32 field_0xB04; //0xB04
	u32 field_0xB08; //0xB08
	u32 field_0xB0C; //0xB0C
	u32 field_0xB10; //0xB10
	u32 field_0xB14; //0xB14
	u32 field_0xB18; //0xB18
	u32 field_0xB1C; //0xB1C
	u32 field_0xB20; //0xB20
	u32 field_0xB24; //0xB24
	u32 field_0xB28; //0xB28
	u32 field_0xB2C; //0xB2C
	u32 field_0xB30; //0xB30
	u32 field_0xB34; //0xB34
	u32 field_0xB38; //0xB38
	u32 field_0xB3C; //0xB3C
	u32 field_0xB40; //0xB40
	u32 field_0xB44; //0xB44
	u32 field_0xB48; //0xB48
	u32 field_0xB4C; //0xB4C
	u32 field_0xB50; //0xB50
	u32 field_0xB54; //0xB54
	u32 field_0xB58; //0xB58
	u32 field_0xB5C; //0xB5C
	u32 field_0xB60; //0xB60
	u32 field_0xB64; //0xB64
	u32 field_0xB68; //0xB68
	u32 field_0xB6C; //0xB6C
	u32 field_0xB70; //0xB70
	u32 field_0xB74; //0xB74
	u32 field_0xB78; //0xB78
	u32 field_0xB7C; //0xB7C
	u32 field_0xB80; //0xB80
	u32 field_0xB84; //0xB84
	u32 field_0xB88; //0xB88
	u32 field_0xB8C; //0xB8C
	u32 field_0xB90; //0xB90
	u32 field_0xB94; //0xB94
	u32 field_0xB98; //0xB98
	u32 field_0xB9C; //0xB9C
	u32 field_0xBA0; //0xBA0
	u32 field_0xBA4; //0xBA4
	u32 field_0xBA8; //0xBA8
	u32 field_0xBAC; //0xBAC
	u32 field_0xBB0; //0xBB0
	u32 field_0xBB4; //0xBB4
	u32 field_0xBB8; //0xBB8
	u32 field_0xBBC; //0xBBC
	u32 field_0xBC0; //0xBC0
	u32 field_0xBC4; //0xBC4
	u32 field_0xBC8; //0xBC8
	u32 field_0xBCC; //0xBCC
	u32 field_0xBD0; //0xBD0
	u32 field_0xBD4; //0xBD4
	u32 field_0xBD8; //0xBD8
	u32 field_0xBDC; //0xBDC
	u32 field_0xBE0; //0xBE0
	u32 field_0xBE4; //0xBE4
	u32 field_0xBE8; //0xBE8
	u32 field_0xBEC; //0xBEC
	u32 field_0xBF0; //0xBF0
	u32 field_0xBF4; //0xBF4
	u32 field_0xBF8; //0xBF8
	u32 field_0xBFC; //0xBFC
	u32 field_0xC00; //0xC00
	u32 field_0xC04; //0xC04
	u32 field_0xC08; //0xC08
	u32 field_0xC0C; //0xC0C
	u32 field_0xC10; //0xC10
	u32 field_0xC14; //0xC14
	u32 field_0xC18; //0xC18
	u32 field_0xC1C; //0xC1C
	u32 field_0xC20; //0xC20
	u32 field_0xC24; //0xC24
	u32 field_0xC28; //0xC28
	u32 field_0xC2C; //0xC2C
	u32 field_0xC30; //0xC30
	u32 field_0xC34; //0xC34
	u32 field_0xC38; //0xC38
	u32 field_0xC3C; //0xC3C
	u32 field_0xC40; //0xC40
	u32 field_0xC44; //0xC44
	u32 field_0xC48; //0xC48
	u32 field_0xC4C; //0xC4C
	u32 field_0xC50; //0xC50
	u32 field_0xC54; //0xC54
	u32 field_0xC58; //0xC58
	u32 field_0xC5C; //0xC5C
	u32 field_0xC60; //0xC60
	u32 field_0xC64; //0xC64
	u32 field_0xC68; //0xC68
	u32 field_0xC6C; //0xC6C
	u32 field_0xC70; //0xC70
	u32 field_0xC74; //0xC74
	u32 field_0xC78; //0xC78
	u32 field_0xC7C; //0xC7C
	u32 field_0xC80; //0xC80
	u32 field_0xC84; //0xC84
	u32 field_0xC88; //0xC88
	u32 field_0xC8C; //0xC8C
	u32 field_0xC90; //0xC90
	u32 field_0xC94; //0xC94
	u32 field_0xC98; //0xC98
	u32 field_0xC9C; //0xC9C
	u32 field_0xCA0; //0xCA0
	u32 field_0xCA4; //0xCA4
	u32 field_0xCA8; //0xCA8
	u32 field_0xCAC; //0xCAC
	u32 field_0xCB0; //0xCB0
	u32 field_0xCB4; //0xCB4
	u32 field_0xCB8; //0xCB8
	u32 field_0xCBC; //0xCBC
	u32 field_0xCC0; //0xCC0
	u32 field_0xCC4; //0xCC4
	u32 field_0xCC8; //0xCC8
	u32 field_0xCCC; //0xCCC
	u32 field_0xCD0; //0xCD0
	u32 field_0xCD4; //0xCD4
	u32 field_0xCD8; //0xCD8
	u32 field_0xCDC; //0xCDC
	u32 field_0xCE0; //0xCE0
	u32 field_0xCE4; //0xCE4
	u32 field_0xCE8; //0xCE8
	u32 field_0xCEC; //0xCEC
	u32 field_0xCF0; //0xCF0
	u32 field_0xCF4; //0xCF4
	u32 field_0xCF8; //0xCF8
	u32 field_0xCFC; //0xCFC
	u32 field_0xD00; //0xD00
	u32 field_0xD04; //0xD04
	u32 field_0xD08; //0xD08
	u32 field_0xD0C; //0xD0C
	u32 field_0xD10; //0xD10
	u32 field_0xD14; //0xD14
	u32 field_0xD18; //0xD18
	u32 field_0xD1C; //0xD1C
	u32 field_0xD20; //0xD20
	u32 field_0xD24; //0xD24
	u32 field_0xD28; //0xD28
	u32 field_0xD2C; //0xD2C
	u32 field_0xD30; //0xD30
	u32 field_0xD34; //0xD34
	u32 field_0xD38; //0xD38
	u32 field_0xD3C; //0xD3C
	u32 field_0xD40; //0xD40
	u32 field_0xD44; //0xD44
	u32 field_0xD48; //0xD48
	u32 field_0xD4C; //0xD4C
	u32 field_0xD50; //0xD50
	u32 field_0xD54; //0xD54
	u32 field_0xD58; //0xD58
	u32 field_0xD5C; //0xD5C
	u32 field_0xD60; //0xD60
	u32 field_0xD64; //0xD64
	u32 field_0xD68; //0xD68
	u32 field_0xD6C; //0xD6C
	u32 field_0xD70; //0xD70
	u32 field_0xD74; //0xD74
	u32 field_0xD78; //0xD78
	u32 field_0xD7C; //0xD7C
	u32 field_0xD80; //0xD80
	u32 field_0xD84; //0xD84
	u32 field_0xD88; //0xD88
	u32 field_0xD8C; //0xD8C
	u32 field_0xD90; //0xD90
	u32 field_0xD94; //0xD94
	u32 field_0xD98; //0xD98
	u32 field_0xD9C; //0xD9C
	u32 field_0xDA0; //0xDA0
	u32 field_0xDA4; //0xDA4
	u32 field_0xDA8; //0xDA8
	u32 field_0xDAC; //0xDAC
	u32 field_0xDB0; //0xDB0
	u32 field_0xDB4; //0xDB4
	u32 field_0xDB8; //0xDB8
	u32 field_0xDBC; //0xDBC
	u32 field_0xDC0; //0xDC0
	u32 field_0xDC4; //0xDC4
	u32 field_0xDC8; //0xDC8
	u32 field_0xDCC; //0xDCC
	u32 field_0xDD0; //0xDD0
	u32 field_0xDD4; //0xDD4
	u32 field_0xDD8; //0xDD8
	u32 field_0xDDC; //0xDDC
	u32 field_0xDE0; //0xDE0
	u32 field_0xDE4; //0xDE4
	u32 field_0xDE8; //0xDE8
	u32 field_0xDEC; //0xDEC
	u32 field_0xDF0; //0xDF0
	u32 field_0xDF4; //0xDF4
	u32 field_0xDF8; //0xDF8
	u32 field_0xDFC; //0xDFC
	u32 field_0xE00; //0xE00
	u32 field_0xE04; //0xE04
	u32 field_0xE08; //0xE08
	u32 field_0xE0C; //0xE0C
	u32 field_0xE10; //0xE10
	u32 field_0xE14; //0xE14
	u32 field_0xE18; //0xE18
	u32 field_0xE1C; //0xE1C
	u32 field_0xE20; //0xE20
	u32 field_0xE24; //0xE24
	u32 field_0xE28; //0xE28
	u32 field_0xE2C; //0xE2C
	u32 field_0xE30; //0xE30
	u32 field_0xE34; //0xE34
	u32 field_0xE38; //0xE38
	u32 field_0xE3C; //0xE3C
	u32 field_0xE40; //0xE40
	u32 field_0xE44; //0xE44
	u32 field_0xE48; //0xE48
	u32 field_0xE4C; //0xE4C
	u32 field_0xE50; //0xE50
	u32 field_0xE54; //0xE54
	u32 field_0xE58; //0xE58
	u32 field_0xE5C; //0xE5C
	u32 field_0xE60; //0xE60
	u32 field_0xE64; //0xE64
	u32 field_0xE68; //0xE68
	u32 field_0xE6C; //0xE6C
	u32 field_0xE70; //0xE70
	u32 field_0xE74; //0xE74
	u32 field_0xE78; //0xE78
	u32 field_0xE7C; //0xE7C
	u32 field_0xE80; //0xE80
	u32 field_0xE84; //0xE84
	u32 field_0xE88; //0xE88
	u32 field_0xE8C; //0xE8C
	u32 field_0xE90; //0xE90
	u32 field_0xE94; //0xE94
	u32 field_0xE98; //0xE98
	u32 field_0xE9C; //0xE9C
	u32 field_0xEA0; //0xEA0
	u32 field_0xEA4; //0xEA4
	u32 field_0xEA8; //0xEA8
	u32 field_0xEAC; //0xEAC
	u32 field_0xEB0; //0xEB0
	u32 field_0xEB4; //0xEB4
	u32 field_0xEB8; //0xEB8
	u32 field_0xEBC; //0xEBC
	u32 field_0xEC0; //0xEC0
	u32 field_0xEC4; //0xEC4
	u32 field_0xEC8; //0xEC8
	u32 field_0xECC; //0xECC
	u32 field_0xED0; //0xED0
	u32 field_0xED4; //0xED4
	u32 field_0xED8; //0xED8
	u32 field_0xEDC; //0xEDC
	u32 field_0xEE0; //0xEE0
	u32 field_0xEE4; //0xEE4
	u32 field_0xEE8; //0xEE8
	u32 field_0xEEC; //0xEEC
	u32 field_0xEF0; //0xEF0
	u32 field_0xEF4; //0xEF4
	u32 field_0xEF8; //0xEF8
	u32 field_0xEFC; //0xEFC
	u32 field_0xF00; //0xF00
	u32 field_0xF04; //0xF04
	u32 field_0xF08; //0xF08
	u32 field_0xF0C; //0xF0C
	u32 field_0xF10; //0xF10
	u32 field_0xF14; //0xF14
	u32 field_0xF18; //0xF18
	u32 field_0xF1C; //0xF1C
	u32 field_0xF20; //0xF20
	u32 field_0xF24; //0xF24
	u32 field_0xF28; //0xF28
	u32 field_0xF2C; //0xF2C
	u32 field_0xF30; //0xF30
	u32 field_0xF34; //0xF34
	u32 field_0xF38; //0xF38
	u32 field_0xF3C; //0xF3C
	u32 field_0xF40; //0xF40
	u32 field_0xF44; //0xF44
	u32 field_0xF48; //0xF48
	u32 field_0xF4C; //0xF4C
	u32 field_0xF50; //0xF50
	u32 field_0xF54; //0xF54
	u32 field_0xF58; //0xF58
	u32 field_0xF5C; //0xF5C
	u32 field_0xF60; //0xF60
	u32 field_0xF64; //0xF64
	u32 field_0xF68; //0xF68
	u32 field_0xF6C; //0xF6C
	u32 field_0xF70; //0xF70
	u32 field_0xF74; //0xF74
	u32 field_0xF78; //0xF78
	u32 field_0xF7C; //0xF7C
	u32 field_0xF80; //0xF80
	u32 field_0xF84; //0xF84
	u32 field_0xF88; //0xF88
	u32 field_0xF8C; //0xF8C
	u32 field_0xF90; //0xF90
	u32 field_0xF94; //0xF94
	u32 field_0xF98; //0xF98
	u32 field_0xF9C; //0xF9C
	u32 field_0xFA0; //0xFA0
	u32 field_0xFA4; //0xFA4
	u32 field_0xFA8; //0xFA8
	u32 field_0xFAC; //0xFAC
	u32 field_0xFB0; //0xFB0
	u32 field_0xFB4; //0xFB4
	u32 field_0xFB8; //0xFB8
	u32 field_0xFBC; //0xFBC
	u32 field_0xFC0; //0xFC0
	u32 field_0xFC4; //0xFC4
	u32 field_0xFC8; //0xFC8
	u32 field_0xFCC; //0xFCC
	u32 field_0xFD0; //0xFD0
	u32 field_0xFD4; //0xFD4
	u32 field_0xFD8; //0xFD8
	u32 field_0xFDC; //0xFDC
	u32 field_0xFE0; //0xFE0
	u32 field_0xFE4; //0xFE4
	u32 field_0xFE8; //0xFE8
	u32 field_0xFEC; //0xFEC
	u32 field_0xFF0; //0xFF0
	u32 field_0xFF4; //0xFF4
	u32 field_0xFF8; //0xFF8
	u32 field_0xFFC; //0xFFC
	u32 field_0x1000; //0x1000
	u32 field_0x1004; //0x1004
	u32 field_0x1008; //0x1008
	u32 field_0x100C; //0x100C
	u32 field_0x1010; //0x1010
	u32 field_0x1014; //0x1014
	u32 field_0x1018; //0x1018
	u32 field_0x101C; //0x101C
	u32 field_0x1020; //0x1020
	u32 field_0x1024; //0x1024
	u32 field_0x1028; //0x1028
	u32 field_0x102C; //0x102C
	u32 field_0x1030; //0x1030
	u32 field_0x1034; //0x1034
	u32 field_0x1038; //0x1038
	u32 field_0x103C; //0x103C
	u32 field_0x1040; //0x1040
	u32 field_0x1044; //0x1044
	u32 field_0x1048; //0x1048
	u32 field_0x104C; //0x104C
	u32 field_0x1050; //0x1050
	u32 field_0x1054; //0x1054
	u32 field_0x1058; //0x1058
	u32 field_0x105C; //0x105C
	u32 field_0x1060; //0x1060
	u32 field_0x1064; //0x1064
	u32 field_0x1068; //0x1068
	u32 field_0x106C; //0x106C
	u32 field_0x1070; //0x1070
	u32 field_0x1074; //0x1074
	u32 field_0x1078; //0x1078
	u32 field_0x107C; //0x107C
	u32 field_0x1080; //0x1080
	u32 field_0x1084; //0x1084
	u32 field_0x1088; //0x1088
	u32 field_0x108C; //0x108C
	u32 field_0x1090; //0x1090
	u32 field_0x1094; //0x1094
	u32 field_0x1098; //0x1098
	u32 field_0x109C; //0x109C
	u32 field_0x10A0; //0x10A0
	u32 field_0x10A4; //0x10A4
	u32 field_0x10A8; //0x10A8
	u32 field_0x10AC; //0x10AC
	u32 field_0x10B0; //0x10B0
	u32 field_0x10B4; //0x10B4
	u32 field_0x10B8; //0x10B8
	u32 field_0x10BC; //0x10BC
	u32 field_0x10C0; //0x10C0
	u32 field_0x10C4; //0x10C4
	u32 field_0x10C8; //0x10C8
	u32 field_0x10CC; //0x10CC
	u32 field_0x10D0; //0x10D0
	u32 field_0x10D4; //0x10D4
	u32 field_0x10D8; //0x10D8
	u32 field_0x10DC; //0x10DC
	u32 field_0x10E0; //0x10E0
	u32 field_0x10E4; //0x10E4
	u32 field_0x10E8; //0x10E8
	u32 field_0x10EC; //0x10EC
	u32 field_0x10F0; //0x10F0
	u32 field_0x10F4; //0x10F4
	u32 field_0x10F8; //0x10F8
	u32 field_0x10FC; //0x10FC
	u32 field_0x1100; //0x1100
	u32 field_0x1104; //0x1104
	u32 field_0x1108; //0x1108
	u32 field_0x110C; //0x110C
	u32 field_0x1110; //0x1110
	u32 field_0x1114; //0x1114
	u32 field_0x1118; //0x1118
	u32 field_0x111C; //0x111C
	u32 field_0x1120; //0x1120
	u32 field_0x1124; //0x1124
	u32 field_0x1128; //0x1128
	u32 field_0x112C; //0x112C
	u32 field_0x1130; //0x1130
	u32 field_0x1134; //0x1134
	u32 field_0x1138; //0x1138
	u32 field_0x113C; //0x113C
	u32 field_0x1140; //0x1140
	u32 field_0x1144; //0x1144
	u32 field_0x1148; //0x1148
	u32 field_0x114C; //0x114C
	u32 field_0x1150; //0x1150
	u32 field_0x1154; //0x1154
	u32 field_0x1158; //0x1158
	u32 field_0x115C; //0x115C
	u32 field_0x1160; //0x1160
	u32 field_0x1164; //0x1164
	u32 field_0x1168; //0x1168
	u32 field_0x116C; //0x116C
	u32 field_0x1170; //0x1170
	u32 field_0x1174; //0x1174
	u32 field_0x1178; //0x1178
	u32 field_0x117C; //0x117C
	u32 field_0x1180; //0x1180
	u32 field_0x1184; //0x1184
	u32 field_0x1188; //0x1188
	u32 field_0x118C; //0x118C
	u32 field_0x1190; //0x1190
	u32 field_0x1194; //0x1194
	u32 field_0x1198; //0x1198
	u32 field_0x119C; //0x119C
	u32 field_0x11A0; //0x11A0
	u32 field_0x11A4; //0x11A4
	u32 field_0x11A8; //0x11A8
	u32 field_0x11AC; //0x11AC
	u32 field_0x11B0; //0x11B0
	u32 field_0x11B4; //0x11B4
	u32 field_0x11B8; //0x11B8
	u32 field_0x11BC; //0x11BC
	u32 field_0x11C0; //0x11C0
	u32 field_0x11C4; //0x11C4
	u32 field_0x11C8; //0x11C8
	u32 field_0x11CC; //0x11CC
	u32 field_0x11D0; //0x11D0
	u32 field_0x11D4; //0x11D4
	u32 field_0x11D8; //0x11D8
	u32 field_0x11DC; //0x11DC
	u32 field_0x11E0; //0x11E0
	u32 field_0x11E4; //0x11E4
	u32 field_0x11E8; //0x11E8
	u32 field_0x11EC; //0x11EC
	u32 field_0x11F0; //0x11F0
	u32 field_0x11F4; //0x11F4
	u32 field_0x11F8; //0x11F8
	u32 field_0x11FC; //0x11FC
	u32 field_0x1200; //0x1200
	u32 field_0x1204; //0x1204
	u32 field_0x1208; //0x1208
	u32 field_0x120C; //0x120C
	u32 field_0x1210; //0x1210
	u32 field_0x1214; //0x1214
	u32 field_0x1218; //0x1218
	u32 field_0x121C; //0x121C
	u32 field_0x1220; //0x1220
	u32 field_0x1224; //0x1224
	u32 field_0x1228; //0x1228
	u32 field_0x122C; //0x122C
	u32 field_0x1230; //0x1230
	u32 field_0x1234; //0x1234
	u32 field_0x1238; //0x1238
	u32 field_0x123C; //0x123C
	u32 field_0x1240; //0x1240
	u32 field_0x1244; //0x1244
	u32 field_0x1248; //0x1248
	u32 field_0x124C; //0x124C
	u32 field_0x1250; //0x1250
	u32 field_0x1254; //0x1254
	u32 field_0x1258; //0x1258
	u32 field_0x125C; //0x125C
	u32 field_0x1260; //0x1260
	u32 field_0x1264; //0x1264
	u32 field_0x1268; //0x1268
	u32 field_0x126C; //0x126C
	u32 field_0x1270; //0x1270
	u32 field_0x1274; //0x1274
	u32 field_0x1278; //0x1278
	u32 field_0x127C; //0x127C
	u32 field_0x1280; //0x1280
	u32 field_0x1284; //0x1284
	u32 field_0x1288; //0x1288
	u32 field_0x128C; //0x128C
	u32 field_0x1290; //0x1290
	u32 field_0x1294; //0x1294
	u32 field_0x1298; //0x1298
	u32 field_0x129C; //0x129C
	u32 field_0x12A0; //0x12A0
	u32 field_0x12A4; //0x12A4
	u32 field_0x12A8; //0x12A8
	u32 field_0x12AC; //0x12AC
	u32 field_0x12B0; //0x12B0
	u32 field_0x12B4; //0x12B4
	u32 field_0x12B8; //0x12B8
	u32 field_0x12BC; //0x12BC
	u32 field_0x12C0; //0x12C0
	u32 field_0x12C4; //0x12C4
	u32 field_0x12C8; //0x12C8
	u32 field_0x12CC; //0x12CC
	u32 field_0x12D0; //0x12D0
	u32 field_0x12D4; //0x12D4
	u32 field_0x12D8; //0x12D8
	u32 field_0x12DC; //0x12DC
	u32 field_0x12E0; //0x12E0
	u32 field_0x12E4; //0x12E4
	u32 field_0x12E8; //0x12E8
	u32 field_0x12EC; //0x12EC
	u32 field_0x12F0; //0x12F0
	u32 field_0x12F4; //0x12F4
	u32 field_0x12F8; //0x12F8
	u32 field_0x12FC; //0x12FC
	u32 field_0x1300; //0x1300
	u32 field_0x1304; //0x1304
	u32 field_0x1308; //0x1308
	u32 field_0x130C; //0x130C
	u32 field_0x1310; //0x1310
	u32 field_0x1314; //0x1314
	u32 field_0x1318; //0x1318
	u32 field_0x131C; //0x131C
	u32 field_0x1320; //0x1320
	u32 field_0x1324; //0x1324
	u32 field_0x1328; //0x1328
	u32 field_0x132C; //0x132C
	u32 field_0x1330; //0x1330
	u32 field_0x1334; //0x1334
	u32 field_0x1338; //0x1338
	u32 field_0x133C; //0x133C
	u32 field_0x1340; //0x1340
	u32 field_0x1344; //0x1344
	u32 field_0x1348; //0x1348
	u32 field_0x134C; //0x134C
	u32 field_0x1350; //0x1350
	u32 field_0x1354; //0x1354
	u32 field_0x1358; //0x1358
	u32 field_0x135C; //0x135C
	u32 field_0x1360; //0x1360
	u32 field_0x1364; //0x1364
	u32 field_0x1368; //0x1368
	u32 field_0x136C; //0x136C
	u32 field_0x1370; //0x1370
	u32 field_0x1374; //0x1374
	u32 field_0x1378; //0x1378
	u32 field_0x137C; //0x137C
	u32 field_0x1380; //0x1380
	u32 field_0x1384; //0x1384
	u32 field_0x1388; //0x1388
	u32 field_0x138C; //0x138C
	u32 field_0x1390; //0x1390
	u32 field_0x1394; //0x1394
	u32 field_0x1398; //0x1398
	u32 field_0x139C; //0x139C
	u32 field_0x13A0; //0x13A0
	u32 field_0x13A4; //0x13A4
	u32 field_0x13A8; //0x13A8
	u32 field_0x13AC; //0x13AC
	u32 field_0x13B0; //0x13B0
	u32 field_0x13B4; //0x13B4
	u32 field_0x13B8; //0x13B8
	u32 field_0x13BC; //0x13BC
	u32 field_0x13C0; //0x13C0
	u32 field_0x13C4; //0x13C4
	u32 field_0x13C8; //0x13C8
	u32 field_0x13CC; //0x13CC
	u32 field_0x13D0; //0x13D0
	u32 field_0x13D4; //0x13D4
} marioSt_gp;

marioSt_gp marioSt;
marioSt_gp* gp = &marioSt;

GXRenderModeObj sRMObjHReso = {
	VI_TVMODE_NTSC_INT, //viTVmode
	0x260, //fbWidth
	0x1C0, //efbHeight
	0x1C0, //xfbHeight
	0x1B, //viXOrigin
	0x10, //viYOrigin
	0x29A, //viWidth
	0x1C0, //viHeight
	VI_XFBMODE_DF, //xFBmode
	0, //field_rendering
	0, //aa
	6, 6, 6, 6, 6, 6, //pix 0
	6, 6, 6, 6, 6, 6, //pix 1
	6, 6, 6, 6, 6, 6, //pix 2
	6, 6, 6, 6, 6, 6, //pix 3
	8, 8, 10, 12, 10, 8, 8, //vfilter
};

GXRenderModeObj sRMObjHReso_prog = {
	VI_TVMODE_NTSC_PROG, //viTVmode
	0x260, //fbWidth
	0x1C0, //efbHeight
	0x1C0, //xfbHeight
	0x1B, //viXOrigin
	0x10, //viYOrigin
	0x29A, //viWidth
	0x1C0, //viHeight
	VI_XFBMODE_SF, //xFBmode
	0, //field_rendering
	0, //aa
	6, 6, 6, 6, 6, 6, //pix 0
	6, 6, 6, 6, 6, 6, //pix 1
	6, 6, 6, 6, 6, 6, //pix 2
	6, 6, 6, 6, 6, 6, //pix 3
	8, 8, 10, 12, 10, 8, 8, //vfilter
};

GXRenderModeObj GXNtsc480IntDfMarioSt = {
	VI_TVMODE_NTSC_INT, //viTVmode
	0x260, //fbWidth
