#pragma once

#include <dolphin/os.h>

typedef struct marioStruct {
	u32 flags; //0x0
	s32 fps; //0x04, TODO double check s32 cuz double conversion
	u8 field_0x8[0x14 - 0x8]; //0x8
	u32 isBattleInit; //0x14
	u32 field_0x18; //0x18
	u32 field_0x1C; //0x1C
	u64 field_0x20; //0x20
	u64 field_0x28; //0x28
	OSTime startTime; //0x30
	OSTime animationTimeIncludingBattle; //0x38, TODO better name
	u64 field_0x40; //0x40
	u64 field_0x48; //0x48
	u64 field_0x50; //0x50
	u64 field_0x58; //0x58
	u64 field_0x60; //0x60
	u8 field_0x68[0xF8 - 0x68]; //0x68
	u32 field_0xF8; //0xF8
	u32 field_0xFC; //0xFC
	u32 field_0x100; //0x100
	u32 field_0x104; //0x104
	u32 field_0x108; //0x108
	u32 field_0x10C; //0x10C
	u32 field_0x110; //0x110
	u32 field_0x114; //0x114
	u8 field_0x118[0x16C - 0x118]; //0x118
	u32 isJP; //0x16C, TODO better name?
	u16 fbWidth; //0x170
	u16 efbHeight; //0x172
	u32 mGSW0; //0x174, first entry is a u32
	u8 mGSFW[0x400]; //0x178
	u8 mGSW[0x800]; //0x578
	u8 mLSWF[0x40]; //0xD78
	u8 mLSW[0x400]; //0xDB8
	u8 field_0x11B8[0x1274 - 0x11B8]; //0x11B8
	u32 field_0x1274; //0x1274
	u8 field_0x1278[0x1294 - 0x1278]; //0x1298
	u32 field_0x1294; //0x1294
	u8 field_0x1298[0x1314 - 0x1298]; //0x1298
	OSTick deltaGame; //0x1314
	OSTick deltaRender; //0x1318
	u8 field_0x131C[0x13D8 - 0x131C]; //0x131C
} marioStruct;

//u32 test = sizeof(marioSt); // 0x13D8/5080

void marioStInit(void);
void marioStMain(void);
void marioStDisp(void);