#pragma once

#include "mgr/filemgr.h"
#include <dolphin/types.h>

typedef struct NameEntryWork {
	u16 field_0x0; //0x0
	u8 field_0x2[2]; //0x2, padding?
	s32 field_0x4; //0x4
	s32 field_0x8; //0x8
	s32 field_0xC; //0xC
	s32 field_0x10; //0x10
	s32 field_0x14; //0x14
	s32 field_0x18; //0x18
	f32 x1; //0x1C
	f32 y1; //0x20
	f32 x2; //0x24
	f32 y2; //0x28
	f32 field_0x2C; //0x2C
	f32 field_0x30; //0x30
	f32 field_0x34; //0x34
	f32 field_0x38; //0x38
	char field_0x3C[16]; //0x3C, TODO: determine full size
	u8 field_0x4C[0x50 - 0x4C]; //0x4C
	const char** field_0x50; //0x50, currentTable?
	f32 field_0x54; //0x54
	u8 field_0x58[0x5C - 0x58]; //0x58
	s32 field_0x5C; //0x5C
	FileEntry* field_0x60; //0x60, tpl assets
} NameEntryWork;

void nameEntInit(void);
void nameEntReInit(void);
void nameEntMain(void);