#pragma once

#include <dolphin/types.h>

typedef struct seq_title_work {
	u32 field_0x0; //0x00
	u32 field_0x4; //0x04
	u32 field_0x8; //0x08
	u32 field_0xC; //0x0C
	u32 field_0x10; //0x10
	u32 field_0x14; //0x14
	u32 field_0x18; //0x18
	u32 field_0x1C; //0x1C
	u32 field_0x20; //0x20
	u32 field_0x24; //0x24
	u32 field_0x28; //0x28
	u32 field_0x2C; //0x2C
	s32 debugMode; //0x30
	u32 field_0x34; //0x34
} seq_title_work;