#pragma once

#include <dolphin/mtx.h>

typedef struct StatusWindowWork {
	u8 field_0x0[0x4 - 0x0]; //0x0
	s16 field_0x4; //0x4
	u8 align_0x6[2]; //0x6
	f32 field_0x8; //0x8
	f32 field_0xC; //0xC
	f32 field_0x10; //0x10
	u8 field_0x14[0x18 - 0x14]; //0x14
	f32 field_0x18; //0x18
	f32 field_0x1C; //0x1C
	f32 field_0x20; //0x20, iconxbase?
	f32 field_0x24; //0x24, iconybase?
	u8 field_0x28[0x30 - 0x28]; //0x28
	f32 field_0x30; //0x30
	f32 field_0x34; //0x34
	u8 field_0x38[0x40 - 0x38]; //0x38
	f32 field_0x40; //0x40
	f32 field_0x44; //0x44
	u8 field_0x48[0x62 - 0x48]; //0x48
	s16 field_0x62; //0x62
	u8 field_0x64[0x68 - 0x64]; //0x64
	Vec field_0x68; //0x68
	s32 field_0x74; //0x74
	s32 field_0x78; //0x78
	s32 field_0x7C; //0x7C
	s32 field_0x80; //0x80
	u8 field_0x84[0x88 - 0x84]; //0x84
	s32 field_0x88; //0x88
} StatusWindowWork;

void statusWinInit(void);
void statusWinReInit(void);
void statusWinMain(void);