#pragma once

#include "texPalette.h"
#include <dolphin/gx.h>

typedef struct fadedrv_somestruct {
	u32 field_0x0; //0x00
	u32 field_0x4; //0x04
	u32 field_0x8; //0x08
	u32 field_0xC; //0x0C
	u32 field_0x10; //0x10
	u32 field_0x14; //0x14
	u32 field_0x18; //0x18
	f32 field_0x1C; //0x1C
	f32 field_0x20; //0x20
	u32 field_0x24; //0x24
	u32 field_0x28; //0x28
	u32 field_0x2C; //0x2C
	u32 field_0x30; //0x30
	u32 field_0x34; //0x34
	u32 field_0x38; //0x38
	u32 field_0x3C; //0x3C
	u32 field_0x40; //0x40
	u32 field_0x44; //0x44
	u32 field_0x48; //0x48
	u32 field_0x4C; //0x4C
	u32 field_0x50; //0x50
	u32 field_0x54; //0x54
	u32 field_0x58; //0x58
	u32 field_0x5C; //0x5C
	u32 field_0x60; //0x60
	u32 field_0x64; //0x64
	u32 field_0x68; //0x68
	s32 field_0x6C; //0x6C
	s32 field_0x70; //0x70
	u32 field_0x74; //0x74
	f32 field_0x78; //0x78
	f32 field_0x7C; //0x7C
	u32 field_0x80; //0x80
	u32 field_0x84; //0x84
	u32 field_0x88; //0x88
	u32 field_0x8C; //0x8C
	f32 field_0x90; //0x90
	u32 field_0x94; //0x94
	u32 field_0x98; //0x98
	u32 field_0x9C; //0x9C
	u32 field_0xA0; //0xA0
	u32 field_0xA4; //0xA4
} fadedrv_somestruct;

typedef struct fadedrv_work {
	u32 field_0x0; //0x0
	u32 field_0x4; //0x4
	fadedrv_somestruct field_0x8[5]; //0x8
	s32 field_0x350; //0x350
	u32 field_0x354; //0x354
	TPLHeader* tpl_header; //0x358
	BOOL tpl_loaded; //0x35C, TODO decide "unpacked" vs "loaded"
} fadedrv_work;

void fadeEntry(s32 type, s32 duration, GXColor color);
void fadeReset(u32 id);  //TODO: better param name?


void fadeInit(void);

BOOL fadeIsFinish(void);
